content/cloud_service_computing.org
#+TITLE: Cloud Service Computing
#+OPTIONS: num:nil
#+STARTUP: overview
* Cloud computation
** Platform Virtualization
*** Defination of Virtualization
the processes of creating software-based version of resources.
*** The reasons for applying virtualization
- *Utilization*: Server consolidation
- *Isolation*: Implication of errors is restricted in virtual resource only
- *Flexiblity*: many Application access the same physical Hardware
- *On-demand*: virtual resource is created/destoryed on request
- *Migration*: Fault tolerance, live update, optimization of performance
- New reaserch:new OS new technology
- Encapsulation: current stats can be saved  copied and loaded
- Minimal downtime
- Fast provisioning
  
*** Full virtualization (Hypervisor system, Bare matal)
- Translation of instructions
- implantation: Virtual Box
- Hypervisor receive the IO from application,and translate to HW
- Hypervisor translate the request from Guest OS to HW
- no need special HW support  
- no need modified OS

*** Hardware-assisted virtualization (Hypervisor system, Bare matal)
- implantation: VMware Workstation
- can install many virtual machine
- need special HW support
- no need modified OS

*** Para virtualization (Hypervisor system, Bare matal)

- VM(modified OS) runs on Host
- Host on hypervisor
- implantation: linux kernel
  
- need modified OS
- need Host OS level on hypervisor

*** Host OS virtualization (Hypervisor system, Hosted)
- Guest OS on Hypervisor
- Hypervisor on Host OS
- Host on HW
  

- no need modified OS
- need Hypervisor on Host OS
- inter VM communication is difficult


*** OS-level virtualization (Container system)
- no hypervisor
- multiple useer instances(light-weight) run on a host OS
- implantation: Docker

*** Memory virtualization
- shadow page table on Guest OS 
- Extended Page table in Host
*** Network virtualization
hypervisor provide virtual switch, offering every VM a ip address
*** Feathers
| Encapsulation        |
| solation             |
| Hardware abstraction |
| Migration            |
| Partation            |

** Docker
*** old note
|--------------------------------------------+-----------------|
| comands                                    | expains         |
|--------------------------------------------+-----------------|
| docker images                              | 查看容器        |
| docker pull nginx  [fn:nginx]              | 新增            |
| docker run -d -p 80:80 nginx [fn:docker-v] | 开始，id， 后台 |
| docker exec -it xxxxxx bash                | 前台进入，      |
| docker commit xxxxxx newname               | 生成新容器      |
| docker kill -s KILL xxxxxx                 | 关闭            |
|--------------------------------------------+-----------------|


[fn:nginx] 对于新到手的项目可以直接放到容器的nginx根目录（快速部署 /usr/share/nginx/html），可以在映射的
本机端口进入


[fn:docker-v] to my case:
#+begin_src 
sudo docker run -d -p 80:80 -v /home/sx/Documents/Java/ANANProject/layuimini/:/usr/share/nginx/html/ nginx
#+end_src

Beispile
#+begin_src 

sudo docker images
sudo docker pull nginx
sudo docker run -d -p 80:80 nginx -> id:xxxxxxx
sudo docker exec -it -v /....../project:/usr/share/nginx/html xxxxxxx
build in - > local host :80  
#+end_src
