cloud_service_computing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-18 Fri 17:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cloud Service Computing</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css" />
</head>
<body>
<div id="content">
<h1 class="title">Cloud Service Computing</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org911d760">Cloud computation</a>
<ul>
<li><a href="#org84208bb">Platform Virtualization</a>
<ul>
<li><a href="#org72c8633">Defination of Virtualization</a></li>
<li><a href="#org8fdcf4f">The reasons for applying virtualization</a></li>
<li><a href="#org5a2eb8e">Full virtualization (Hypervisor system, Bare matal)</a></li>
<li><a href="#org244c5fa">Hardware-assisted virtualization (Hypervisor system, Bare matal)</a></li>
<li><a href="#org353c019">Para virtualization (Hypervisor system, Bare matal)</a></li>
<li><a href="#org1862bc6">Host OS virtualization (Hypervisor system, Hosted)</a></li>
<li><a href="#org9b735be">OS-level virtualization (Container system)</a></li>
<li><a href="#orgeb46bb4">Memory virtualization</a></li>
<li><a href="#org4866daa">Network virtualization</a></li>
<li><a href="#org696183a">Feathers</a></li>
</ul>
</li>
<li><a href="#orgd602336">Docker</a>
<ul>
<li><a href="#org2d343e2">old note</a></li>
<li><a href="#orgbd0b68e">commands</a></li>
<li><a href="#orgb6b2b00">discripation</a></li>
</ul>
</li>
<li><a href="#org77a2172">Kubernetes</a></li>
<li><a href="#org2910520">Virtual Machine</a></li>
<li><a href="#orgda6a014">Storage Virtualization</a>
<ul>
<li><a href="#org42fbb12">SSD advantage and disadvanage over HDD</a></li>
<li><a href="#org881fefc">Storage virtualization advantage</a></li>
<li><a href="#orgbbb494e">Provisioning:</a></li>
<li><a href="#org73fc023">Deduplication</a></li>
<li><a href="#org740d796">Compression:</a></li>
<li><a href="#orgd6bac1c">Cloning</a></li>
<li><a href="#orgfc55da6">Snapshotting Copies</a></li>
<li><a href="#org25d3d6e">increasing the proformance</a></li>
</ul>
</li>
<li><a href="#orgb75fd2e">Modern Datacenters</a>
<ul>
<li><a href="#org5fea01b">automation</a></li>
<li><a href="#org2e9c4c8">Idempotent</a></li>
<li><a href="#org6282365">Infrastructure as code</a></li>
<li><a href="#org68ef290">Foreman:</a></li>
<li><a href="#org9766d38">Puppet</a></li>
</ul>
</li>
<li><a href="#orgd42f366">Monitor</a>
<ul>
<li><a href="#org8855084">challange</a></li>
<li><a href="#orgf118b7e">Real time monitoring</a></li>
<li><a href="#orgf0c3dee">Historical Monitoring</a></li>
<li><a href="#orgcd8eef6">Architecture</a></li>
</ul>
</li>
<li><a href="#orge01a4a1">Cloud Computing Concepts</a>
<ul>
<li><a href="#orgde9d9fa">Cloud Defination</a></li>
<li><a href="#orgc7cf26f">SOA</a></li>
<li><a href="#org311ec94">Advantage</a></li>
<li><a href="#org6fa7ac8">Network design</a></li>
<li><a href="#org9d161eb">GWDG feathers</a></li>
<li><a href="#org0939eeb">Infrastructure as Service</a></li>
<li><a href="#orgda553d7">Platform as a Service</a></li>
<li><a href="#org8ac0874">Software as a Service</a></li>
</ul>
</li>
<li><a href="#orgce334cb">Web services</a>
<ul>
<li><a href="#org1f83ab0">Benefits</a></li>
<li><a href="#org37470f6">SOAP</a></li>
<li><a href="#org5e76ee3">WSDL</a></li>
<li><a href="#orgd93d12f">REST</a></li>
<li><a href="#org6ee2309">API</a></li>
</ul>
</li>
<li><a href="#orgc2a11a7">Big Data Service</a>
<ul>
<li><a href="#org5f58efb">feathers</a></li>
<li><a href="#org96e223e">processes</a></li>
<li><a href="#org97b14eb">Challenges</a></li>
</ul>
</li>
<li><a href="#org1636e34">Mapreduce</a></li>
<li><a href="#org8e17457">Large Scale Data Analysis</a>
<ul>
<li><a href="#org2c740e0">batch process</a></li>
<li><a href="#org8da7683">steaming process</a></li>
<li><a href="#org39f1884">Stream Computation Platform</a></li>
<li><a href="#org719d0a2">Hadoop</a></li>
<li><a href="#orgc5bd10b">HDFS</a></li>
<li><a href="#org5585ea5">YARN</a></li>
<li><a href="#org18287aa">Apache Kafka</a></li>
<li><a href="#orga2e2611">Data management cycle</a></li>
</ul>
</li>
<li><a href="#orgae9666d">Data Grid Data Management</a>
<ul>
<li><a href="#orgd1fa5a8">Data Lake</a></li>
<li><a href="#org86c487d">ETL</a></li>
<li><a href="#org830b3ea">Storage data in Multiable locations</a></li>
<li><a href="#org84717ae">Storage data in remote data center</a></li>
<li><a href="#org2dc02f2">code storage</a></li>
<li><a href="#orgb884158">fair data management</a></li>
</ul>
</li>
<li><a href="#orga7aa06a">ITIL &amp;SLA</a>
<ul>
<li><a href="#orgbfc4c8c">non functional service</a></li>
<li><a href="#orgd893641">ITIL Information Technology Infrastructure Library</a></li>
<li><a href="#org3bdde56">SLA Service Level Agreement Life cycle</a></li>
<li><a href="#org7f1ae2d">SLA components include</a></li>
</ul>
</li>
<li><a href="#org6fd690c">Security</a>
<ul>
<li><a href="#org97a20b0">Confidentiality</a></li>
<li><a href="#org50f457e">Integrity</a></li>
<li><a href="#orgfbf5c73">Availablity</a></li>
<li><a href="#org90b0f0e">Asymmetric Encrytion RSA</a></li>
<li><a href="#org853b651">security benefits</a></li>
<li><a href="#orga7b42dc">symmetric encryption</a></li>
<li><a href="#orgbe20405">asymmetic encryption</a></li>
<li><a href="#org7421257">Digital Signiture</a></li>
<li><a href="#orgc43733d">how Certificate is trusted</a></li>
<li><a href="#org525a5b3">Authentication</a></li>
<li><a href="#org6fad264">Authorization</a></li>
<li><a href="#orgebbdcef">Confusion and Diffusion</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org02cac34">Paraiell computation</a>
<ul>
<li><a href="#orgc67b9ec">Chap1: introduction</a>
<ul>
<li><a href="#org2993184">Von Nroven</a></li>
<li><a href="#org9aa3592">memory mode</a></li>
<li><a href="#org374005f">shared memory</a></li>
<li><a href="#org9c88b1f">distribution memory</a></li>
</ul>
</li>
<li><a href="#orgf1afb4d">Chap 2: Proformance</a>
<ul>
<li><a href="#org19ec2c8">single Process:</a></li>
<li><a href="#org54999c3">Multi processes</a></li>
<li><a href="#org3a3341c">Efficient</a></li>
<li><a href="#org63a6dd8">Adaes-low</a></li>
<li><a href="#orgbf38a8a">Gustafon low</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8236527">AWS</a></li>
<li><a href="#org5f69b29">Alibaba</a></li>
<li><a href="#org4e66b00">GWDG</a></li>
</ul>
</div>
</div>
<div id="outline-container-org911d760" class="outline-2">
<h2 id="org911d760">Cloud computation</h2>
<div class="outline-text-2" id="text-org911d760">
</div>
<div id="outline-container-org84208bb" class="outline-3">
<h3 id="org84208bb">Platform Virtualization</h3>
<div class="outline-text-3" id="text-org84208bb">
</div>
<div id="outline-container-org72c8633" class="outline-4">
<h4 id="org72c8633">Defination of Virtualization</h4>
<div class="outline-text-4" id="text-org72c8633">
<p>
the processes of creating software-based version of resources.
</p>
</div>
</div>
<div id="outline-container-org8fdcf4f" class="outline-4">
<h4 id="org8fdcf4f">The reasons for applying virtualization</h4>
<div class="outline-text-4" id="text-org8fdcf4f">
<ul class="org-ul">
<li><b>Utilization</b>: Server consolidation</li>
<li><b>Isolation</b>: Implication of errors is restricted in virtual resource only</li>
<li><b>Flexiblity</b>: many Application access the same physical Hardware</li>
<li><b>On-demand</b>: virtual resource is created/destoryed on request</li>
<li><b>Migration</b>: Fault tolerance, live update, optimization of performance</li>
<li>New reaserch:new OS new technology</li>
<li>Encapsulation: current stats can be saved  copied and loaded</li>
<li>Minimal downtime</li>
<li>Fast provisioning</li>
</ul>
</div>
</div>

<div id="outline-container-org5a2eb8e" class="outline-4">
<h4 id="org5a2eb8e">Full virtualization (Hypervisor system, Bare matal)</h4>
<div class="outline-text-4" id="text-org5a2eb8e">
<ul class="org-ul">
<li>Translation of instructions</li>
<li>implantation: Virtual Box</li>
<li>Hypervisor receive the IO from application,and translate to HW</li>
<li>Hypervisor translate the request from Guest OS to HW</li>
<li>no need special HW support</li>
<li>no need modified OS</li>
</ul>
</div>
</div>

<div id="outline-container-org244c5fa" class="outline-4">
<h4 id="org244c5fa">Hardware-assisted virtualization (Hypervisor system, Bare matal)</h4>
<div class="outline-text-4" id="text-org244c5fa">
<ul class="org-ul">
<li>implantation: VMware Workstation</li>
<li>can install many virtual machine</li>
<li>need special HW support</li>
<li>no need modified OS</li>
</ul>
</div>
</div>

<div id="outline-container-org353c019" class="outline-4">
<h4 id="org353c019">Para virtualization (Hypervisor system, Bare matal)</h4>
<div class="outline-text-4" id="text-org353c019">
<ul class="org-ul">
<li>VM(modified OS) runs on Host</li>
<li>Host on hypervisor</li>
<li>implantation: linux kernel</li>

<li>need modified OS</li>
<li>need Host OS level on hypervisor</li>
</ul>
</div>
</div>

<div id="outline-container-org1862bc6" class="outline-4">
<h4 id="org1862bc6">Host OS virtualization (Hypervisor system, Hosted)</h4>
<div class="outline-text-4" id="text-org1862bc6">
<ul class="org-ul">
<li>Guest OS on Hypervisor</li>
<li>Hypervisor on Host OS</li>
<li>Host on HW</li>
</ul>


<ul class="org-ul">
<li>no need modified OS</li>
<li>need Hypervisor on Host OS</li>
<li>inter VM communication is difficult</li>
</ul>
</div>
</div>


<div id="outline-container-org9b735be" class="outline-4">
<h4 id="org9b735be">OS-level virtualization (Container system)</h4>
<div class="outline-text-4" id="text-org9b735be">
<ul class="org-ul">
<li>no hypervisor</li>
<li>multiple useer instances(light-weight) run on a host OS</li>
<li>implantation: Docker</li>
</ul>
</div>
</div>

<div id="outline-container-orgeb46bb4" class="outline-4">
<h4 id="orgeb46bb4">Memory virtualization</h4>
<div class="outline-text-4" id="text-orgeb46bb4">
<ul class="org-ul">
<li>shadow page table on Guest OS</li>
<li>Extended Page table in Host</li>
</ul>
</div>
</div>
<div id="outline-container-org4866daa" class="outline-4">
<h4 id="org4866daa">Network virtualization</h4>
<div class="outline-text-4" id="text-org4866daa">
<p>
hypervisor provide virtual switch, offering every VM a ip address
</p>
</div>
</div>
<div id="outline-container-org696183a" class="outline-4">
<h4 id="org696183a">Feathers</h4>
<div class="outline-text-4" id="text-org696183a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Encapsulation</td>
</tr>

<tr>
<td class="org-left">solation</td>
</tr>

<tr>
<td class="org-left">Hardware abstraction</td>
</tr>

<tr>
<td class="org-left">Migration</td>
</tr>

<tr>
<td class="org-left">Partation</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgd602336" class="outline-3">
<h3 id="orgd602336">Docker</h3>
<div class="outline-text-3" id="text-orgd602336">
</div>
<div id="outline-container-org2d343e2" class="outline-4">
<h4 id="org2d343e2">old note</h4>
<div class="outline-text-4" id="text-org2d343e2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">comands</th>
<th scope="col" class="org-left">expains</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">docker images</td>
<td class="org-left">查看容器</td>
</tr>

<tr>
<td class="org-left">docker pull nginx  <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></td>
<td class="org-left">新增</td>
</tr>

<tr>
<td class="org-left">docker run -d -p 80:80 nginx <sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></td>
<td class="org-left">开始，id， 后台</td>
</tr>

<tr>
<td class="org-left">docker exec -it xxxxxx bash</td>
<td class="org-left">前台进入，</td>
</tr>

<tr>
<td class="org-left">docker commit xxxxxx newname</td>
<td class="org-left">生成新容器</td>
</tr>

<tr>
<td class="org-left">docker kill -s KILL xxxxxx</td>
<td class="org-left">关闭</td>
</tr>
</tbody>
</table>
</div>
</div>
