content/cloud_service_computing.org
*** commands

- docker pull NAME

- docker images
- docker images -a
  
- docker run NAME
- docker run NAME:VERSION
- docker run -d NAME
- docker run -p6000:6379 -d redis
- docker run -p6000:6379 -d  --name redis-older redis

- docker exec -it ID /bin/bash
- docker exec -it NAME /bin/bash

  
- docker ps
- docker ps -a2

- docker start ID
- docker stop ID

- docker logs ID
  
*** discripation
| fast delivery         |
| easy deploy and scale |
| run more workloads    |
| easy management       |
| lightweight image     |
| No guest OS           |

- Disadvanage: can not change kernel
- Less secure than VM

- Docker Registry hold Docker Images
- Docker Images create Docker Container(run as instance)
- Docker Container runs applications
- the shared levels are readonly, and containers communicate with sockets or Restful API
** Kubernetes
Container-Orchestration System 
- Cluster
- Control Plane
- Workload:application on Kubernetes
- Pod: many containers share the same volume
- Deployment
- Service

** Virtual Machine
- Partition
- Isolation
- Encapsulation
- Hardware abstraction
- Live Migration

** Storage Virtualization
*** SSD advantage and disadvanage over HDD
- Reliablity
- Fast
- small Size

- More expensive
- less Space

*** Storage virtualization advantage
- Faster access: because you can have multiple data sources for the same data
- Independence of logic storage resources
- improvement of management: Moving data easy, in multiple localaction
- High reliablity:  because of Redundancy
- High effience: Replication and Duplication
- compression, compaction
- increasing volume if needed

*** Provisioning:
- allocate disk space to user on demand
- give a mount of Storage, but not really allocated so much

*** Deduplication
  Single instance Storage: 
  if the hash value of a datablock is the same with one we already stored,
  dann save its link
  - checksum with hash value
   
*** Compression:
compacting the data so that it comsumes less space
*** Cloning
Consuming no storage except what is required for metadata until changes
are written to the copy
*** Snapshotting Copies
a read-only, point-in-time image of a volume
*** increasing the proformance
with more physical disks at the same time
** Modern Datacenters
*** automation
- scaling
- Inreases Repeatablity
- Make processes Faster
- imporve Reliablity

- disadvanage
  Additional Complexity
  illusion of Stability

*** Idempotent
the same code generate the same result, without any change

*** Infrastructure as code
- Benefits:
  + Repeatablity
  + Agility
  + Disaster Recovery
  + fast deploy
  + live upgrade
  
- Imperative:describe the stes to get to desired state
- Declarative: describe the desired state

*** Foreman:
give the initial configuration to run an OS
*** Puppet
- Declarative description of resource states
- Client / server Architecture
- Security throgh cettificate
- OS abstraction
** Monitor
*** challange
collecte data from large mount of servers
Watch out the overhitting
*** Real time monitoring
- Availability Monitoring: altering of failure
- Capacity Monitoring: detect outages of resource
*** Historical Monitoring
- Long-term information
- Trend analysis
- Capacity planning
*** Architecture
- Measurement: Blackbox, Whitebot,Gauges, Conntes
- Collection: push, pull
- Analysis: real time, short term, long term, Anomaly detection with AI
- Alerting:
- Virtualization
  
** Cloud Computing Concepts
*** Cloud Defination
#+begin_src 
Cloud Computing is a model for enabling on-demand network
access to a shared pool of configurable computing resource
(network, server, storage, application, service) that can
be rapidly provisioned and released with minimal management
effort or service provider interaction
#+end_src


*** SOA
Servive Oriented Architecture
SOA has become a core concept of service computing and provides the
fundamental technologies for realizing service computing
*** Advantage
- No captial costs
- High scalability
- Highh Flexiblity

*** Network design
Different: SDN: software define Network
New architectures have a detached control plane
instead of heavy logic switching/routing in hardware
- hardware independent
- better shaping and Qos(Quit of service)
- Data Center Briding for local and remote network
*** GWDG feathers
- self service front-end
- SSH authenticate
- snapshotting
- using Openstack


*** Infrastructure as Service
**** Different deployment methode
| Private Cloud   |
| community Cloud |
| public Cloud    |
| Hybird Cloud    |
**** Storage
CDMI: Cloud Data Management Interface
File, Block Devices, Object Stores, Database Store
example: AWS S3
**** Network
