cloud_service_computing.html
<div id="outline-container-orgbd0b68e" class="outline-4">
<h4 id="orgbd0b68e">commands</h4>
<div class="outline-text-4" id="text-orgbd0b68e">
<ul class="org-ul">
<li>docker pull NAME</li>

<li>docker images</li>
<li>docker images -a</li>

<li>docker run NAME</li>
<li>docker run NAME:VERSION</li>
<li>docker run -d NAME</li>
<li>docker run -p6000:6379 -d redis</li>
<li>docker run -p6000:6379 -d  &#x2013;name redis-older redis</li>

<li>docker exec -it ID /bin/bash</li>
<li>docker exec -it NAME /bin/bash</li>
</ul>


<ul class="org-ul">
<li>docker ps</li>
<li>docker ps -a2</li>

<li>docker start ID</li>
<li>docker stop ID</li>

<li>docker logs ID</li>
</ul>
</div>
</div>

<div id="outline-container-orgb6b2b00" class="outline-4">
<h4 id="orgb6b2b00">discripation</h4>
<div class="outline-text-4" id="text-orgb6b2b00">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">fast delivery</td>
</tr>

<tr>
<td class="org-left">easy deploy and scale</td>
</tr>

<tr>
<td class="org-left">run more workloads</td>
</tr>

<tr>
<td class="org-left">easy management</td>
</tr>

<tr>
<td class="org-left">lightweight image</td>
</tr>

<tr>
<td class="org-left">No guest OS</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Disadvanage: can not change kernel</li>
<li>Less secure than VM</li>

<li>Docker Registry hold Docker Images</li>
<li>Docker Images create Docker Container(run as instance)</li>
<li>Docker Container runs applications</li>
<li>the shared levels are readonly, and containers communicate with sockets or Restful API</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org77a2172" class="outline-3">
<h3 id="org77a2172">Kubernetes</h3>
<div class="outline-text-3" id="text-org77a2172">
<p>
Container-Orchestration System 
</p>
<ul class="org-ul">
<li>Cluster</li>
<li>Control Plane</li>
<li>Workload:application on Kubernetes</li>
<li>Pod: many containers share the same volume</li>
<li>Deployment</li>
<li>Service</li>
</ul>
</div>
</div>

<div id="outline-container-org2910520" class="outline-3">
<h3 id="org2910520">Virtual Machine</h3>
<div class="outline-text-3" id="text-org2910520">
<ul class="org-ul">
<li>Partition</li>
<li>Isolation</li>
<li>Encapsulation</li>
<li>Hardware abstraction</li>
<li>Live Migration</li>
</ul>
</div>
</div>

<div id="outline-container-orgda6a014" class="outline-3">
<h3 id="orgda6a014">Storage Virtualization</h3>
<div class="outline-text-3" id="text-orgda6a014">
</div>
<div id="outline-container-org42fbb12" class="outline-4">
<h4 id="org42fbb12">SSD advantage and disadvanage over HDD</h4>
<div class="outline-text-4" id="text-org42fbb12">
<ul class="org-ul">
<li>Reliablity</li>
<li>Fast</li>
<li>small Size</li>

<li>More expensive</li>
<li>less Space</li>
</ul>
</div>
</div>

<div id="outline-container-org881fefc" class="outline-4">
<h4 id="org881fefc">Storage virtualization advantage</h4>
<div class="outline-text-4" id="text-org881fefc">
<ul class="org-ul">
<li>Faster access: because you can have multiple data sources for the same data</li>
<li>Independence of logic storage resources</li>
<li>improvement of management: Moving data easy, in multiple localaction</li>
<li>High reliablity:  because of Redundancy</li>
<li>High effience: Replication and Duplication</li>
<li>compression, compaction</li>
<li>increasing volume if needed</li>
</ul>
</div>
</div>

<div id="outline-container-orgbbb494e" class="outline-4">
<h4 id="orgbbb494e">Provisioning:</h4>
<div class="outline-text-4" id="text-orgbbb494e">
<ul class="org-ul">
<li>allocate disk space to user on demand</li>
<li>give a mount of Storage, but not really allocated so much</li>
</ul>
</div>
</div>

<div id="outline-container-org73fc023" class="outline-4">
<h4 id="org73fc023">Deduplication</h4>
<div class="outline-text-4" id="text-org73fc023">
<p>
Single instance Storage: 
if the hash value of a datablock is the same with one we already stored,
dann save its link
</p>
<ul class="org-ul">
<li>checksum with hash value</li>
</ul>
</div>
</div>

<div id="outline-container-org740d796" class="outline-4">
<h4 id="org740d796">Compression:</h4>
<div class="outline-text-4" id="text-org740d796">
<p>
compacting the data so that it comsumes less space
</p>
</div>
</div>
<div id="outline-container-orgd6bac1c" class="outline-4">
<h4 id="orgd6bac1c">Cloning</h4>
<div class="outline-text-4" id="text-orgd6bac1c">
<p>
Consuming no storage except what is required for metadata until changes
are written to the copy
</p>
</div>
</div>
<div id="outline-container-orgfc55da6" class="outline-4">
<h4 id="orgfc55da6">Snapshotting Copies</h4>
<div class="outline-text-4" id="text-orgfc55da6">
<p>
a read-only, point-in-time image of a volume
</p>
</div>
</div>
<div id="outline-container-org25d3d6e" class="outline-4">
<h4 id="org25d3d6e">increasing the proformance</h4>
<div class="outline-text-4" id="text-org25d3d6e">
<p>
with more physical disks at the same time
</p>
</div>
</div>
</div>
<div id="outline-container-orgb75fd2e" class="outline-3">
<h3 id="orgb75fd2e">Modern Datacenters</h3>
<div class="outline-text-3" id="text-orgb75fd2e">
</div>
<div id="outline-container-org5fea01b" class="outline-4">
<h4 id="org5fea01b">automation</h4>
<div class="outline-text-4" id="text-org5fea01b">
<ul class="org-ul">
<li>scaling</li>
<li>Inreases Repeatablity</li>
<li>Make processes Faster</li>
<li>imporve Reliablity</li>

<li>disadvanage
Additional Complexity
illusion of Stability</li>
</ul>
</div>
</div>

<div id="outline-container-org2e9c4c8" class="outline-4">
<h4 id="org2e9c4c8">Idempotent</h4>
<div class="outline-text-4" id="text-org2e9c4c8">
<p>
the same code generate the same result, without any change
</p>
</div>
</div>

<div id="outline-container-org6282365" class="outline-4">
<h4 id="org6282365">Infrastructure as code</h4>
<div class="outline-text-4" id="text-org6282365">
<ul class="org-ul">
<li>Benefits:
<ul class="org-ul">
<li>Repeatablity</li>
<li>Agility</li>
<li>Disaster Recovery</li>
<li>fast deploy</li>
<li>live upgrade</li>
</ul></li>

<li>Imperative:describe the stes to get to desired state</li>
<li>Declarative: describe the desired state</li>
</ul>
</div>
</div>

<div id="outline-container-org68ef290" class="outline-4">
<h4 id="org68ef290">Foreman:</h4>
<div class="outline-text-4" id="text-org68ef290">
<p>
give the initial configuration to run an OS
</p>
</div>
</div>
<div id="outline-container-org9766d38" class="outline-4">
<h4 id="org9766d38">Puppet</h4>
<div class="outline-text-4" id="text-org9766d38">
<ul class="org-ul">
<li>Declarative description of resource states</li>
<li>Client / server Architecture</li>
<li>Security throgh cettificate</li>
<li>OS abstraction</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd42f366" class="outline-3">
<h3 id="orgd42f366">Monitor</h3>
<div class="outline-text-3" id="text-orgd42f366">
</div>
<div id="outline-container-org8855084" class="outline-4">
<h4 id="org8855084">challange</h4>
<div class="outline-text-4" id="text-org8855084">
<p>
collecte data from large mount of servers
Watch out the overhitting
</p>
</div>
</div>
<div id="outline-container-orgf118b7e" class="outline-4">
<h4 id="orgf118b7e">Real time monitoring</h4>
<div class="outline-text-4" id="text-orgf118b7e">
<ul class="org-ul">
<li>Availability Monitoring: altering of failure</li>
<li>Capacity Monitoring: detect outages of resource</li>
</ul>
</div>
</div>
<div id="outline-container-orgf0c3dee" class="outline-4">
<h4 id="orgf0c3dee">Historical Monitoring</h4>
<div class="outline-text-4" id="text-orgf0c3dee">
<ul class="org-ul">
<li>Long-term information</li>
<li>Trend analysis</li>
<li>Capacity planning</li>
</ul>
</div>
</div>
<div id="outline-container-orgcd8eef6" class="outline-4">
<h4 id="orgcd8eef6">Architecture</h4>
<div class="outline-text-4" id="text-orgcd8eef6">
<ul class="org-ul">
<li>Measurement: Blackbox, Whitebot,Gauges, Conntes</li>
<li>Collection: push, pull</li>
<li>Analysis: real time, short term, long term, Anomaly detection with AI</li>
<li>Alerting:</li>
<li>Virtualization</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge01a4a1" class="outline-3">
<h3 id="orge01a4a1">Cloud Computing Concepts</h3>
<div class="outline-text-3" id="text-orge01a4a1">
</div>
<div id="outline-container-orgde9d9fa" class="outline-4">
<h4 id="orgde9d9fa">Cloud Defination</h4>
<div class="outline-text-4" id="text-orgde9d9fa">
<pre class="example">
Cloud Computing is a model for enabling on-demand network
access to a shared pool of configurable computing resource
(network, server, storage, application, service) that can
be rapidly provisioned and released with minimal management
effort or service provider interaction
</pre>
</div>
</div>


<div id="outline-container-orgc7cf26f" class="outline-4">
<h4 id="orgc7cf26f">SOA</h4>
<div class="outline-text-4" id="text-orgc7cf26f">
<p>
Servive Oriented Architecture
SOA has become a core concept of service computing and provides the
fundamental technologies for realizing service computing
</p>
</div>
</div>
<div id="outline-container-org311ec94" class="outline-4">
<h4 id="org311ec94">Advantage</h4>
<div class="outline-text-4" id="text-org311ec94">
<ul class="org-ul">
<li>No captial costs</li>
<li>High scalability</li>
<li>Highh Flexiblity</li>
</ul>
</div>
</div>

<div id="outline-container-org6fa7ac8" class="outline-4">
<h4 id="org6fa7ac8">Network design</h4>
<div class="outline-text-4" id="text-org6fa7ac8">
<p>
Different: SDN: software define Network
New architectures have a detached control plane
instead of heavy logic switching/routing in hardware
</p>
<ul class="org-ul">
<li>hardware independent</li>
<li>better shaping and Qos(Quit of service)</li>
<li>Data Center Briding for local and remote network</li>
</ul>
</div>
</div>
<div id="outline-container-org9d161eb" class="outline-4">
<h4 id="org9d161eb">GWDG feathers</h4>
<div class="outline-text-4" id="text-org9d161eb">
<ul class="org-ul">
<li>self service front-end</li>
<li>SSH authenticate</li>
<li>snapshotting</li>
<li>using Openstack</li>
</ul>
</div>
</div>


<div id="outline-container-org0939eeb" class="outline-4">
<h4 id="org0939eeb">Infrastructure as Service</h4>
<div class="outline-text-4" id="text-org0939eeb">
</div>
<ul class="org-ul">
<li><a id="org9b1368f"></a>Different deployment methode<br />
<div class="outline-text-5" id="text-org9b1368f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Private Cloud</td>
</tr>

<tr>
<td class="org-left">community Cloud</td>
</tr>

<tr>
<td class="org-left">public Cloud</td>
</tr>

<tr>
<td class="org-left">Hybird Cloud</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org6866320"></a>Storage<br />
<div class="outline-text-5" id="text-org6866320">
<p>
CDMI: Cloud Data Management Interface
File, Block Devices, Object Stores, Database Store
example: AWS S3
</p>
</div>
</li>
