content/cloud_service_computing.org
**** advantage
- quick implement of new project
- Flexiblity and scalability
- no hardware costs
- pay only what you need
**** disadvantage
- complicated to change provider
- dependency on provider
- internet access is essential

*** Platform as a Service
- Rapid Time-to-Market
- Minimal Development
- Reduced Pressure on internal resources


*** Software as a Service
based on IaaS, fouce on Applications

** Web services
*** Benefits
- Programmable access
- Distribution over internet
- Encapsulation of discrete functionality
- can offer stardartized Interface
  + TCP/IP prokotoll
  + HTTP based
*** SOAP
Simple Object Access Protocol
xml based
RPC based
*** WSDL
Web Services Description Language
xml based

*** REST
+ Everything is resource
+ Every resource is identified by a unique Identifier
+ Using simple and uniform interface
+ Communication is done by representation
+ be stateless

- more flexiblity
- less redundancy, raw message based
- URI and URL

*** API
Application Programming Interface

** Big Data Service
*** feathers
- Volume: Scale of data
- Velocity : spend of transfer data
- Variety: Different form of data
- Veracity: Uncertainty of data
*** processes
- Acquisition, Recording
- Extraction, Cleaning, Annotation
- Integration, Representation
- Analysis, Modeling
- Interpretation, Virtualization
*** Challenges
- Heterogeneity, Incompleteness
- Scale
- Timeliness
- Privacy
** Mapreduce
| map       | map the data into key-value-pairs according to our problem |
| reduce    | key-value-pairs get accumlated                             |
| shuffling |                                                            |
** Large Scale Data Analysis
*** batch process
disadvanage: views generated in batch may out of date
*** steaming process
disadvanage: expensive and complex
*** Stream Computation Platform
- Apache Storm
- Spark Streaming
- Apache Flink
- Heron
*** Hadoop
*** HDFS
Namenode vs DataNodes
*** YARN
Resource Manager vs NodeManager
*** Apache Kafka
- Fast, efficient IO
- Fault tolerant storage
- Publish and Subscribe to steams of records
*** Data management cycle
- Data
- Meta-data
- PID
- Search
- Disposition
** Data Grid Data Management
*** Data Lake
A data lake is a data storage, where raw data can be stored,
whos structure is determined at the extraction from the lake
**** Challenges
- Reliablity
- Slow Performance
- Lack of security
**** Zones
- Transient
- raw
- trusted
- refined
*** ETL
Extract transform load
*** Storage data in Multiable locations
Redundancy for high-availability because of server falied and
fast access of data
*** Storage data in remote data center
it is harder to acidentally delete something, such as because
of disaster.
*** code storage
ssd
*** fair data management
Find-able Accessable Interoperable Reproducible

** ITIL &SLA
*** non functional service
organizational Operation of server
server quality like availability
usability

server
value
value co-creation
IT service Management
IT service Provider

*** ITIL Information Technology Infrastructure Library
a framework of best practices of IT service management and delivering 
**** service value system SVS
***** Guiding principles
- focus on value
- start where you are
- progress iteratively with feedback
- collaborate and promote visibility
- think and work holistically
- keep in simple and practical
- optimize and automate
  
***** Service Value Chain
  - plan
  - improve
  - engage
  - design
  - transition
  - obtain
  - deliver

***** ITIL Practices
**** the four dimensions model
Organization&People
Information & Technology
Value streams&Processes
Partners&suppliers
*** SLA Service Level Agreement Life cycle
- Development
- Negotiation
- Implementation
- Execution
- Assessment 
- Termination
*** SLA components include
- Parties,  terms,  conditions
- service defination include costs
- Performance parameters
- what is measured, how and when(monitoring)
- what is done to in case a SLA is voilated

** Security
*** Confidentiality
The ability to hide the information from the unauthorized people
*** Integrity
The ability to ensure that data are unchanged and remain a correct representation of original data
