cloud_service_computing.html
<li><a id="org0bdfc99"></a>Network<br /></li>
<li><a id="org2611512"></a>advantage<br />
<div class="outline-text-5" id="text-org2611512">
<ul class="org-ul">
<li>quick implement of new project</li>
<li>Flexiblity and scalability</li>
<li>no hardware costs</li>
<li>pay only what you need</li>
</ul>
</div>
</li>
<li><a id="org224a7b0"></a>disadvantage<br />
<div class="outline-text-5" id="text-org224a7b0">
<ul class="org-ul">
<li>complicated to change provider</li>
<li>dependency on provider</li>
<li>internet access is essential</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgda553d7" class="outline-4">
<h4 id="orgda553d7">Platform as a Service</h4>
<div class="outline-text-4" id="text-orgda553d7">
<ul class="org-ul">
<li>Rapid Time-to-Market</li>
<li>Minimal Development</li>
<li>Reduced Pressure on internal resources</li>
</ul>
</div>
</div>


<div id="outline-container-org8ac0874" class="outline-4">
<h4 id="org8ac0874">Software as a Service</h4>
<div class="outline-text-4" id="text-org8ac0874">
<p>
based on IaaS, fouce on Applications
</p>
</div>
</div>
</div>

<div id="outline-container-orgce334cb" class="outline-3">
<h3 id="orgce334cb">Web services</h3>
<div class="outline-text-3" id="text-orgce334cb">
</div>
<div id="outline-container-org1f83ab0" class="outline-4">
<h4 id="org1f83ab0">Benefits</h4>
<div class="outline-text-4" id="text-org1f83ab0">
<ul class="org-ul">
<li>Programmable access</li>
<li>Distribution over internet</li>
<li>Encapsulation of discrete functionality</li>
<li>can offer stardartized Interface
<ul class="org-ul">
<li>TCP/IP prokotoll</li>
<li>HTTP based</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org37470f6" class="outline-4">
<h4 id="org37470f6">SOAP</h4>
<div class="outline-text-4" id="text-org37470f6">
<p>
Simple Object Access Protocol
xml based
RPC based
</p>
</div>
</div>
<div id="outline-container-org5e76ee3" class="outline-4">
<h4 id="org5e76ee3">WSDL</h4>
<div class="outline-text-4" id="text-org5e76ee3">
<p>
Web Services Description Language
xml based
</p>
</div>
</div>

<div id="outline-container-orgd93d12f" class="outline-4">
<h4 id="orgd93d12f">REST</h4>
<div class="outline-text-4" id="text-orgd93d12f">
<ul class="org-ul">
<li>Everything is resource</li>
<li>Every resource is identified by a unique Identifier</li>
<li>Using simple and uniform interface</li>
<li>Communication is done by representation</li>
<li>be stateless</li>

<li>more flexiblity</li>
<li>less redundancy, raw message based</li>
<li>URI and URL</li>
</ul>
</div>
</div>

<div id="outline-container-org6ee2309" class="outline-4">
<h4 id="org6ee2309">API</h4>
<div class="outline-text-4" id="text-org6ee2309">
<p>
Application Programming Interface
</p>
</div>
</div>
</div>

<div id="outline-container-orgc2a11a7" class="outline-3">
<h3 id="orgc2a11a7">Big Data Service</h3>
<div class="outline-text-3" id="text-orgc2a11a7">
</div>
<div id="outline-container-org5f58efb" class="outline-4">
<h4 id="org5f58efb">feathers</h4>
<div class="outline-text-4" id="text-org5f58efb">
<ul class="org-ul">
<li>Volume: Scale of data</li>
<li>Velocity : spend of transfer data</li>
<li>Variety: Different form of data</li>
<li>Veracity: Uncertainty of data</li>
</ul>
</div>
</div>
<div id="outline-container-org96e223e" class="outline-4">
<h4 id="org96e223e">processes</h4>
<div class="outline-text-4" id="text-org96e223e">
<ul class="org-ul">
<li>Acquisition, Recording</li>
<li>Extraction, Cleaning, Annotation</li>
<li>Integration, Representation</li>
<li>Analysis, Modeling</li>
<li>Interpretation, Virtualization</li>
</ul>
</div>
</div>
<div id="outline-container-org97b14eb" class="outline-4">
<h4 id="org97b14eb">Challenges</h4>
<div class="outline-text-4" id="text-org97b14eb">
<ul class="org-ul">
<li>Heterogeneity, Incompleteness</li>
<li>Scale</li>
<li>Timeliness</li>
<li>Privacy</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1636e34" class="outline-3">
<h3 id="org1636e34">Mapreduce</h3>
<div class="outline-text-3" id="text-org1636e34">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">map</td>
<td class="org-left">map the data into key-value-pairs according to our problem</td>
</tr>

<tr>
<td class="org-left">reduce</td>
<td class="org-left">key-value-pairs get accumlated</td>
</tr>

<tr>
<td class="org-left">shuffling</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8e17457" class="outline-3">
<h3 id="org8e17457">Large Scale Data Analysis</h3>
<div class="outline-text-3" id="text-org8e17457">
</div>
<div id="outline-container-org2c740e0" class="outline-4">
<h4 id="org2c740e0">batch process</h4>
<div class="outline-text-4" id="text-org2c740e0">
<p>
disadvanage: views generated in batch may out of date
</p>
</div>
</div>
<div id="outline-container-org8da7683" class="outline-4">
<h4 id="org8da7683">steaming process</h4>
<div class="outline-text-4" id="text-org8da7683">
<p>
disadvanage: expensive and complex
</p>
</div>
</div>
<div id="outline-container-org39f1884" class="outline-4">
<h4 id="org39f1884">Stream Computation Platform</h4>
<div class="outline-text-4" id="text-org39f1884">
<ul class="org-ul">
<li>Apache Storm</li>
<li>Spark Streaming</li>
<li>Apache Flink</li>
<li>Heron</li>
</ul>
</div>
</div>
<div id="outline-container-org719d0a2" class="outline-4">
<h4 id="org719d0a2">Hadoop</h4>
</div>
<div id="outline-container-orgc5bd10b" class="outline-4">
<h4 id="orgc5bd10b">HDFS</h4>
<div class="outline-text-4" id="text-orgc5bd10b">
<p>
Namenode vs DataNodes
</p>
</div>
</div>
<div id="outline-container-org5585ea5" class="outline-4">
<h4 id="org5585ea5">YARN</h4>
<div class="outline-text-4" id="text-org5585ea5">
<p>
Resource Manager vs NodeManager
</p>
</div>
</div>
<div id="outline-container-org18287aa" class="outline-4">
<h4 id="org18287aa">Apache Kafka</h4>
<div class="outline-text-4" id="text-org18287aa">
<ul class="org-ul">
<li>Fast, efficient IO</li>
<li>Fault tolerant storage</li>
<li>Publish and Subscribe to steams of records</li>
</ul>
</div>
</div>
<div id="outline-container-orga2e2611" class="outline-4">
<h4 id="orga2e2611">Data management cycle</h4>
<div class="outline-text-4" id="text-orga2e2611">
<ul class="org-ul">
<li>Data</li>
<li>Meta-data</li>
<li>PID</li>
<li>Search</li>
<li>Disposition</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgae9666d" class="outline-3">
<h3 id="orgae9666d">Data Grid Data Management</h3>
<div class="outline-text-3" id="text-orgae9666d">
</div>
<div id="outline-container-orgd1fa5a8" class="outline-4">
<h4 id="orgd1fa5a8">Data Lake</h4>
<div class="outline-text-4" id="text-orgd1fa5a8">
<p>
A data lake is a data storage, where raw data can be stored,
whos structure is determined at the extraction from the lake
</p>
</div>
<ul class="org-ul">
<li><a id="org9e901eb"></a>Challenges<br />
<div class="outline-text-5" id="text-org9e901eb">
<ul class="org-ul">
<li>Reliablity</li>
<li>Slow Performance</li>
<li>Lack of security</li>
</ul>
</div>
</li>
<li><a id="org89c2b42"></a>Zones<br />
<div class="outline-text-5" id="text-org89c2b42">
<ul class="org-ul">
<li>Transient</li>
<li>raw</li>
<li>trusted</li>
<li>refined</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org86c487d" class="outline-4">
<h4 id="org86c487d">ETL</h4>
<div class="outline-text-4" id="text-org86c487d">
<p>
Extract transform load
</p>
</div>
</div>
<div id="outline-container-org830b3ea" class="outline-4">
<h4 id="org830b3ea">Storage data in Multiable locations</h4>
<div class="outline-text-4" id="text-org830b3ea">
<p>
Redundancy for high-availability because of server falied and
fast access of data
</p>
</div>
</div>
<div id="outline-container-org84717ae" class="outline-4">
<h4 id="org84717ae">Storage data in remote data center</h4>
<div class="outline-text-4" id="text-org84717ae">
<p>
it is harder to acidentally delete something, such as because
of disaster.
</p>
</div>
</div>
<div id="outline-container-org2dc02f2" class="outline-4">
<h4 id="org2dc02f2">code storage</h4>
<div class="outline-text-4" id="text-org2dc02f2">
<p>
ssd
</p>
</div>
</div>
<div id="outline-container-orgb884158" class="outline-4">
<h4 id="orgb884158">fair data management</h4>
<div class="outline-text-4" id="text-orgb884158">
<p>
Find-able Accessable Interoperable Reproducible
</p>
</div>
</div>
</div>

<div id="outline-container-orga7aa06a" class="outline-3">
<h3 id="orga7aa06a">ITIL &amp;SLA</h3>
<div class="outline-text-3" id="text-orga7aa06a">
</div>
<div id="outline-container-orgbfc4c8c" class="outline-4">
<h4 id="orgbfc4c8c">non functional service</h4>
<div class="outline-text-4" id="text-orgbfc4c8c">
<p>
organizational Operation of server
server quality like availability
usability
</p>

<p>
server
value
value co-creation
IT service Management
IT service Provider
</p>
</div>
</div>

<div id="outline-container-orgd893641" class="outline-4">
<h4 id="orgd893641">ITIL Information Technology Infrastructure Library</h4>
<div class="outline-text-4" id="text-orgd893641">
<p>
a framework of best practices of IT service management and delivering 
</p>
</div>
<ul class="org-ul">
<li><a id="org833b481"></a>service value system SVS<br />
<ul class="org-ul">
<li><a id="org3a0119a"></a>Guiding principles<br />
<div class="outline-text-6" id="text-org3a0119a">
<ul class="org-ul">
<li>focus on value</li>
<li>start where you are</li>
<li>progress iteratively with feedback</li>
<li>collaborate and promote visibility</li>
<li>think and work holistically</li>
<li>keep in simple and practical</li>
<li>optimize and automate</li>
</ul>
</div>
</li>

<li><a id="org2bd2f20"></a>Service Value Chain<br />
<div class="outline-text-6" id="text-org2bd2f20">
<ul class="org-ul">
<li>plan</li>
<li>improve</li>
<li>engage</li>
<li>design</li>
<li>transition</li>
<li>obtain</li>
<li>deliver</li>
</ul>
</div>
</li>

<li><a id="orgd5c7be9"></a>ITIL Practices<br /></li>
</ul>
</li>
<li><a id="org01780fb"></a>the four dimensions model<br />
<div class="outline-text-5" id="text-org01780fb">
<p>
Organization&amp;People
Information &amp; Technology
Value streams&amp;Processes
Partners&amp;suppliers
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org3bdde56" class="outline-4">
<h4 id="org3bdde56">SLA Service Level Agreement Life cycle</h4>
<div class="outline-text-4" id="text-org3bdde56">
<ul class="org-ul">
<li>Development</li>
<li>Negotiation</li>
<li>Implementation</li>
<li>Execution</li>
<li>Assessment</li>
<li>Termination</li>
</ul>
</div>
</div>
<div id="outline-container-org7f1ae2d" class="outline-4">
<h4 id="org7f1ae2d">SLA components include</h4>
<div class="outline-text-4" id="text-org7f1ae2d">
<ul class="org-ul">
<li>Parties,  terms,  conditions</li>
<li>service defination include costs</li>
<li>Performance parameters</li>
<li>what is measured, how and when(monitoring)</li>
<li>what is done to in case a SLA is voilated</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6fd690c" class="outline-3">
<h3 id="org6fd690c">Security</h3>
<div class="outline-text-3" id="text-org6fd690c">
</div>
<div id="outline-container-org97a20b0" class="outline-4">
<h4 id="org97a20b0">Confidentiality</h4>
<div class="outline-text-4" id="text-org97a20b0">
<p>
The ability to hide the information from the unauthorized people
</p>
</div>
</div>
<div id="outline-container-org50f457e" class="outline-4">
<h4 id="org50f457e">Integrity</h4>
<div class="outline-text-4" id="text-org50f457e">
<p>
The ability to ensure that data are unchanged and remain a correct representation of original data
</p>
</div>
</div>
